In [12]:
import pandas as pd

In [13]:
csv_path = 'data.csv'

In [17]:
df = pd.read_csv(csv_path, encoding = "ISO-8859-1", sep=';')

In [18]:
df

,id,thinklab,date,country,city,region,likelyhood,text
0,1,Almaden,10/22/2018 04:04 pm,NaN,NaN,NaN,10,Very interesting and insightful experience. Fa...
1,2,Almaden,10/19/2018 08:53 pm,NaN,NaN,NaN,10,"The tour was absolutely fascinating, I think t..."
2,3,Almaden,10/19/2018 08:40 am,NaN,NaN,NaN,8,It gives insights from a leading corporation's...
3,4,Almaden,10/19/2018 10:59 am,NaN,NaN,NaN,10,Lecturer is experienced. They shared a lot of ...
4,5,Almaden,05/06/20 12:58,NaN,NaN,NaN,10,NIL
...,...,...,...,...,...,...,...,...
1313,1314,Zurich,09/18/2018 11:47 am,NaN,NaN,NaN,10,good insight
1314,1315,Zurich,11/14/2018 08:53 am,NaN,NaN,NaN,10,Actual insights into research. Inspiring!
1315,1316,Zurich,04/01/19 14:47,NaN,NaN,NaN,9,Valuable insights about what IBM is doing and ...
1316,1317,Zurich,11/06/19 10:02,NaN,NaN,NaN,9,This is great and with very smart people. A lo...
1317,1318,Zurich,01/17/2019 09:18 am,NaN,NaN,NaN,9,very good overview about what's next. Thanks v...

In [19]:
x = df[['text']]

In [20]:
x

                                                   text
0     Very interesting and insightful experience. Fa...
1     The tour was absolutely fascinating, I think t...
2     It gives insights from a leading corporation's...
3     Lecturer is experienced. They shared a lot of ...
4                                                   NIL
...                                                 ...
1313                                       good insight
1314          Actual insights into research. Inspiring!
1315  Valuable insights about what IBM is doing and ...
1316  This is great and with very smart people. A lo...
1317  very good overview about what's next. Thanks v...

[1318 rows x 1 columns]

In [23]:
z = df.iloc[1,1] # search using 2 integers

In [24]:
z

'Almaden'

In [27]:
y = df.loc[1, 'likelyhood'] # search using 'int' and 'str'

In [28]:
y

10

In [29]:
w = df.iloc[0:2,0:3]

In [30]:
w

   id thinklab                 date
0   1  Almaden  10/22/2018 04:04 pm
1   2  Almaden  10/19/2018 08:53 pm

In [32]:
df['thinklab'].unique()

array(['Almaden', 'Bangalore', 'Beijing', 'Dublin', 'Haifa', 'Sao Paulo',
       'Tokyo', 'Yorktown', 'Zurich'], dtype=object)

In [35]:
bu=pd.DataFrame({'a':[1,2,1],'b':[1,1,1]})

In [36]:
bu['a']==1

0     True
1    False
2     True
Name: a, dtype: bool